---
kind: property
id: P:Autodesk.Revit.DB.NumberingSchema.MaximumStartingNumber
source: html/f7a8b906-ee60-2a71-bc1a-30fa81b4f299.htm
---
# Autodesk.Revit.DB.NumberingSchema.MaximumStartingNumber Property

A static property defining the maximum number a numbering sequence can use
 as its starting number (the lowest number in the sequence).

## Syntax (C#)
```csharp
public static int MaximumStartingNumber { get; }
```

## Remarks
Use this method to ensure a value given to the
 ShiftNumbers is within the valid range.